#Область ПрограммныйИнтерфейс

// Формирует документ ОтражениеИзмененияВБюджете по переданым параметрам
// 
// Параметры:
//  Параметры 	- Структура	- см. ИнициализироватьПараметрыОтраженияБюджета()
// 
Процедура ОтразитьИзмененияБюджета(Параметры) Экспорт
	БюджетСервер.ОтразитьИзмененияБюджета(Параметры);			
КонецПроцедуры

// Инициализировать параметры отражения бюджета.
// 
// Возвращаемое значение:
//	Структура	- Структура - Ключи:
//		*СтатьяЗатрат		- СправочникСсылка.СтатьиЗатрат
//		*ИмяДляРазработчика	- Строка
//		*СуммаПлан			- Число
//		*СуммаФакт			- Число
//		*ПериодОтражения	- Дата
// 
Функция ИнициализироватьПараметрыОтраженияБюджета() Экспорт
	Возврат БюджетСервер.ИнициализироватьПараметрыОтраженияБюджета();			
КонецФункции

// Расчитывает итоговые данные за указаный период
// 
// Параметры:
//  ДатаНачала 		- Дата
//  ДатаОкончания	- Дата
// 
// Возвращаемое значение:
// 	Структура - структура с итоговыми данными по бюджету:
//  	* Итого 			- Число
//   	* ИтогоПотрачено 	- Число 
//		* ИтогоОстаток		- Число
// 
Функция ИтоговыеДанныеЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	Возврат БюджетСервер.ИтоговыеДанныеЗаПериод(ДатаНачала, ДатаОкончания);			
КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//// Код процедур и функций
//#КонецОбласти
//
//#Область СлужебныеПроцедурыИФункции
//// Код процедур и функций
//#КонецОбласти